[
    {
        "days": [
            {
                "day_name": "Monday",
                "subjects": [
                    {
                        "subject_name": "Language Arts",
                        "subject_topic": "Theater Terminology",
                        "subject_daily_intro": "Today, we will dive into the fascinating world of theater terminology. We will explore the language that actors, directors, and theater enthusiasts use to convey their craft.",
                        "subject_daily_sub_topics": [
                            "Act",
                            "Scene",
                            "Monologue",
                            "Dialogue",
                            "Stage Directions"
                        ],
                        "subject_topic_daily_summary": "By the end of the day, you will understand essential theater terms, their meanings, and how they are used in context."
                    },
                    {
                        "subject_name": "Math",
                        "subject_topic": "Scientific Notation",
                        "subject_daily_intro": "In mathematics today, we will be learning about scientific notation, a useful way to express very large or very small numbers.",
                        "subject_daily_sub_topics": [
                            "Standard Form",
                            "Exponent Rules",
                            "Applications in Science"
                        ],
                        "subject_topic_daily_summary": "You will be able to convert numbers to scientific notation and perform basic operations involving these forms."
                    },
                    {
                        "subject_name": "Science",
                        "subject_topic": "Gravity and Friction",
                        "subject_daily_intro": "Today in science, we will embark on understanding two fundamental forces: gravity and friction, and their effects on motion.",
                        "subject_daily_sub_topics": [
                            "Newton's Laws of Motion",
                            "Effects of Gravity",
                            "Coefficient of Friction"
                        ],
                        "subject_topic_daily_summary": "By the end of our session, you will grasp how gravity and friction influence movement in our world."
                    },
                    {
                        "subject_name": "Social Studies",
                        "subject_topic": "International Relations",
                        "subject_daily_intro": "This session will introduce you to international relations, a discourse on how countries interact and cooperate with each other. ",
                        "subject_daily_sub_topics": [
                            "Diplomacy",
                            "Cultural Exchange",
                            "Global Issues"
                        ],
                        "subject_topic_daily_summary": "You will learn key concepts and terms related to international relations and understand their significance."
                    }
                ]
            },
            {
                "day_name": "Tuesday",
                "subjects": [
                    {
                        "subject_name": "Language Arts",
                        "subject_topic": "Theater Terminology",
                        "subject_daily_intro": "Yesterday, we explored the basics of theater terminology. Today, we'll delve deeper into how these terms are used in real-life theater productions.",
                        "subject_daily_sub_topics": [
                            "Types of Theaters",
                            "Role of a Director",
                            "Technical Terms"
                        ],
                        "subject_topic_daily_summary": "You will learn how theater terminology applies to different productions and the roles of various participants in theater."
                    },
                    {
                        "subject_name": "Math",
                        "subject_topic": "Scientific Notation",
                        "subject_daily_intro": "Building on our discussion from yesterday, we will practice more complex examples of scientific notation, focusing on operations such as multiplication and division.",
                        "subject_daily_sub_topics": [
                            "Scientific Notation in Calculations",
                            "Real-life Examples"
                        ],
                        "subject_topic_daily_summary": "By the end of today, you’ll be comfortable performing calculations with scientific notation in various scenarios."
                    },
                    {
                        "subject_name": "Science",
                        "subject_topic": "Gravity and Friction",
                        "subject_daily_intro": "Continuing our exploration of gravity and friction, yesterday we defined these forces. Today, we will discuss experiments that illustrate their principles.",
                        "subject_daily_sub_topics": [
                            "Friction Experiments",
                            "Gravity Experiments"
                        ],
                        "subject_topic_daily_summary": "You will have the chance to conceptualize gravity and friction through thought experiments designed to illustrate their effects."
                    },
                    {
                        "subject_name": "Social Studies",
                        "subject_topic": "International Relations",
                        "subject_daily_intro": "Yesterday, we covered the introduction to international relations. Today, we will apply our knowledge to specific case studies of international conflicts and resolutions.",
                        "subject_daily_sub_topics": [
                            "Case Studies",
                            "United Nations Role"
                        ],
                        "subject_topic_daily_summary": "You will analyze real-world examples of how countries engage with one another through international relations."
                    }
                ]
            },
            {
                "day_name": "Wednesday",
                "subjects": [
                    {
                        "subject_name": "Language Arts",
                        "subject_topic": "Theater Terminology",
                        "subject_daily_intro": "Yesterday we discussed real-life applications of theater terminology. Today, we will analyze a scene from a play to identify the terms we've learned.",
                        "subject_daily_sub_topics": [
                            "Analysis Techniques",
                            "Famous Plays"
                        ],
                        "subject_topic_daily_summary": "You will apply your knowledge of theater terminology in a practical context by analyzing and discussing a play's scene."
                    },
                    {
                        "subject_name": "Math",
                        "subject_topic": "Scientific Notation",
                        "subject_daily_intro": "Continuing from our previous class, today we will focus on real-world situations where scientific notation is applied, especially in scientific contexts.",
                        "subject_daily_sub_topics": [
                            "Applications in Chemistry",
                            "Scientific Research Data"
                        ],
                        "subject_topic_daily_summary": "You will gain an appreciation for how scientific notation streamlines the representation of data in scientific fields."
                    },
                    {
                        "subject_name": "Science",
                        "subject_topic": "Gravity and Friction",
                        "subject_daily_intro": "Building on our knowledge from earlier, today we'll look at practical applications related to gravity and friction, such as in engineering and everyday life.",
                        "subject_daily_sub_topics": [
                            "Gravity in Space",
                            "Friction in Sports"
                        ],
                        "subject_topic_daily_summary": "By the end of class, you'll connect theoretical concepts of gravity and friction to practical aspects of engineering and daily activities."
                    },
                    {
                        "subject_name": "Social Studies",
                        "subject_topic": "International Relations",
                        "subject_daily_intro": "In our last class, we analyzed conflicts in international relations. Today, we look at the importance of treaties and agreements in maintaining peace.",
                        "subject_daily_sub_topics": [
                            "Types of Treaties",
                            "Historical Treaties"
                        ],
                        "subject_topic_daily_summary": "You will learn about the role of treaties in international relations and evaluate their impacts on global interactions."
                    }
                ]
            },
            {
                "day_name": "Thursday",
                "subjects": [
                    {
                        "subject_name": "Language Arts",
                        "subject_topic": "Theater Terminology",
                        "subject_daily_intro": "Yesterday, we analyzed a play scene. Today, we'll enhance our understanding by discussing famous actors and their contributions to theater lingo.",
                        "subject_daily_sub_topics": [
                            "Influential Theater Figures",
                            "Impact of Theater on Society"
                        ],
                        "subject_topic_daily_summary": "You will discover how prominent figures in theater have influenced terminology through their performances and contributions."
                    },
                    {
                        "subject_name": "Math",
                        "subject_topic": "Scientific Notation",
                        "subject_daily_intro": "We will continue deepening our understanding of scientific notation by looking at its impact on various fields, especially scientific research.",
                        "subject_daily_sub_topics": [
                            "Engineering Calculations",
                            "Astronomy"
                        ],
                        "subject_topic_daily_summary": "You will learn how scientific notation is essential for calculations in complex fields such as engineering and astronomy."
                    },
                    {
                        "subject_name": "Science",
                        "subject_topic": "Gravity and Friction",
                        "subject_daily_intro": "Today, we will extend our understanding of gravity and friction into the realms of planetary science and mechanical engineering.",
                        "subject_daily_sub_topics": [
                            "Gravity on Different Planets",
                            "Friction in Machines"
                        ],
                        "subject_topic_daily_summary": "By the end of class, you will have insights into how gravity varies across planets and how friction is harnessed in machines."
                    },
                    {
                        "subject_name": "Social Studies",
                        "subject_topic": "International Relations",
                        "subject_daily_intro": "Yesterday we explored treaties. Today, we focus on international organizations, such as the United Nations, and their role in mediation and support.",
                        "subject_daily_sub_topics": [
                            "UN's Functions",
                            "Current Global Issues"
                        ],
                        "subject_topic_daily_summary": "You will understand the significance of international organizations in promoting peace and addressing global challenges."
                    }
                ]
            },
            {
                "day_name": "Friday",
                "subjects": [
                    {
                        "subject_name": "Language Arts",
                        "subject_topic": "Theater Terminology",
                        "subject_daily_intro": "In our final discussion on theater terminology, we will review everything we've learned this week and how to apply it creatively.",
                        "subject_daily_sub_topics": [
                            "Creative Expression",
                            "Making a Scene"
                        ],
                        "subject_topic_daily_summary": "You will synthesize your learning and explore ways to creatively express the terminology we've discussed throughout the week."
                    },
                    {
                        "subject_name": "Math",
                        "subject_topic": "Scientific Notation",
                        "subject_daily_intro": "This marks the conclusion of our study of scientific notation. Today, we'll review key concepts through practice problems and examples.",
                        "subject_daily_sub_topics": [
                            "Practice Problems",
                            "Real-life Applications"
                        ],
                        "subject_topic_daily_summary": "You will solidify your understanding of scientific notation by completing a variety of practice problems and discussing their applications."
                    },
                    {
                        "subject_name": "Science",
                        "subject_topic": "Gravity and Friction",
                        "subject_daily_intro": "As we review our insights on gravity and friction, today will be dedicated to a comprehensive recap of the week and its applications in our lives.",
                        "subject_daily_sub_topics": [
                            "Summary of Key Concepts",
                            "Group Discussions on Experiments"
                        ],
                        "subject_topic_daily_summary": "You will feel more confident about gravity and friction through discussions and reviewing your learned concepts."
                    },
                    {
                        "subject_name": "Social Studies",
                        "subject_topic": "International Relations",
                        "subject_daily_intro": "In our last social studies class on international relations, we will recap key terms and concepts, focusing on the importance of global cooperation.",
                        "subject_daily_sub_topics": [
                            "Review of the Week",
                            "Class Discussion"
                        ],
                        "subject_topic_daily_summary": "You will reflect on what you’ve learned about international relations and how countries work together on common challenges."
                    }
                ]
            }
        ]
    }
]