[
    {
        "lessons": [
            {
                "Lecture": "Hello everyone! Today, we’ll explore operations involving rational and irrational numbers. Understanding how to perform addition and subtraction with these numbers is crucial for your success in math. To begin, let’s review what rational numbers are. A rational number is any number that can be expressed as a fraction, where both the numerator and denominator are integers, and the denominator is not zero. Examples of rational numbers include 1/2, 3, and -4. Notice that these numbers can be positive, negative, or zero. Now, let’s talk about irrational numbers. These are numbers that cannot be expressed as simple fractions. They are non-repeating and non-terminating decimals. Examples you might be familiar with include the square root of 2 and pi (π).  \n\nNow that we’ve reviewed our definitions, let’s move on to adding rational numbers. Addition is straightforward when the numbers share a common denominator. For example, if you want to add 1/2 and 1/3, you first need a common denominator, which is 6 in this case. Thus, 1/2 becomes 3/6 and 1/3 becomes 2/6, so adding them gives us 5/6. Easy, right? \n\nWhen adding rationals, remember to combine the numerators and keep the denominator the same. If they don’t share a common denominator, you’ll need to convert them first! \n  \n$Break time\n\nNow, let’s move to subtracting rational numbers which follows the same principles as addition. Let’s say we want to subtract 5/8 from 3/4. First, convert 3/4 into eighths; it becomes 6/8. So, you would have 6/8 - 5/8, which equals 1/8. If you find the denominators differ, much like addition, get them to match! \n\nNext, let’s talk about irrational numbers. Adding or subtracting irrational numbers can get tricky. For example, if you add √2 and √2, you’ll get 2√2! But, if you try to add √2 and 3, you cannot combine them into a simpler form as they are different types of numbers. \n\n$Break time\n\nNow let’s explore combining rational and irrational numbers. An example here could be adding 1 and √3. The result is an irrational number (1 + √3) because you cannot simplify an integer and an irrational number into a rational form. Keep this in mind; any operation involving an irrational number tends to keep the result in the realm of irrational numbers. \n\nSo one last example before we summarize. If you add √4 (which equals 2) and 1/2, you’re adding a rational number to an integer; keeping the result as a mixed number (2 + 1/2 = 2 1/2). \nRemember these rules as you practice your problems today.",
                "summary": "Today, you learned about operations with rational and irrational numbers. You reviewed the definitions of both types of numbers, practiced addition and subtraction of rational numbers, and explored how to handle irrational numbers. You now understand that combining rational and irrational numbers yields an irrational result, while knowing how to handle adding and subtracting with common denominators is essential. This knowledge will help you solve more complex problems in the future!",
                "wikipedia_refrences": [
                    "https://en.wikipedia.org/wiki/Rational_number",
                    "https://en.wikipedia.org/wiki/Irrational_number",
                    "https://en.wikipedia.org/wiki/Arithmetic"
                ]
            }
        ]
    }
]