[
    {
        "lessons": [
            {
                "Lecture": "We continue with integers today. After discussing operations, we will apply this knowledge to word problems involving integers. \n\nLet's start with a brief recap of what integers are. Remember, integers include all positive whole numbers, negative whole numbers, and zero. An example of positive integers is 3, 7, and 19; on the flip side, some negative integers are -1, -6, and -25.\n\nNext, let's talk about real-world applications of integers. Integers are much more than just numbers you work with in math class—they pop up in various real-life scenarios!\n\nOne key area where integers are essential is in financial contexts, particularly when dealing with debt and credit. For example, if you've ever seen a bank statement, you'll notice that money you've taken out of the bank or owe is listed as a negative number, like -$50, until you pay it back in, which turns it back into $0.\n\nAnother example can be found in temperatures. When we talk about the weather, particularly in colder regions, we might say it's -5 degrees Celsius, indicating that it's five degrees below zero.\n\nLet's dive into some real-world problem-solving using integers. Imagine you're playing an elevator game in a skyscraper. Suppose you start on the 5th floor, then descend 7 floors. What floor are you on now?\n\nLet's do the math: Start at 5, minus 7, which equals -2. Now, since there are no negative floors, this would mean you're technically in the basement or the parking level!\n\n$Break time\n\nFor our next application, think about sea level. Sea level is considered 0. If you go diving, each meter descended is measured in negative integers, while each meter ascended (above sea level) is counted as a positive integer.\n\nLet's say you walk the path of a mountain and rise 1 km to be 100 meters above sea level, then trek down 150 meters back closer to sea level. You began at +100 meters and went down to -50 meters. Quite a hike, right?\n\nHow convenient that integers describe both elevation—above and below sea level—and are also used in competitive gaming scores, where gains earn you points (positive) and losses, debits (negative).\n\nIn sports, point differentials can show an integer example. If your favorite basketball team scores 102, but the opposing team scores 110, the point differential would be -8.\n\nNow, here is a word problem for you. Suppose you start an online auction to sell crafts. Starting with no bids, the highest offer was 20 dollars but then went down 13 dollars due to withdrawal. What is your net offer now?\n\nSolving, we have +20 - 13 = 7 dollars as the current bid on your item.\n\nWrapping up with a final thought, the applications of integers help quantify gains and losses, position differences above and below a point, and even visualize abstract concepts like game scores. By using simple operations like addition and subtraction, integers become highly versatile tools both in math and in practical, everyday use.",
                "summary": "Today, we explored how integers are applied in various real-world scenarios, from finance to elevation measurements. We practiced solving word problems using addition and subtraction of integers, enhancing your problem-solving skills. These concepts show how integers can model credit debts, temperature changes, altitude, and even point differentials in sports, offering a broad perspective of their utility.",
                "wikipedia_refrences": [
                    "https://en.wikipedia.org/wiki/Integer",
                    "https://en.wikipedia.org/wiki/Negative_number",
                    "https://en.wikipedia.org/wiki/Sea_level",
                    "https://en.wikipedia.org/wiki/Elevator#Types"
                ]
            }
        ]
    }
]