[
    {
        "lessons": [
            {
                "Lecture": "We delved into map types yesterday. Today, let’s look at map symbols and how to read them. Let’s start with map legends, also known as keys. A map legend explains what the symbols on a map represent. For instance, a squiggly blue line could indicate a river, a black box might symbolize a building, and a little tree icon might stand for a forest. Understanding these symbols is crucial because they provide a lot of information in a very compact space. You’ll find that each map uses its own unique set of symbols, so the legend is your guide to interpreting these symbols fully. When you become familiar with commonly used symbols, you can quickly gather information by looking at maps.",
                "summary": "Today, we honed our skill in interpreting maps using legends and scale to understand real-world distances and symbols used universally to depict various geographical and man-made features on maps. With these skills, reading maps becomes a powerful tool for exploration and understanding the world around us.",
                "wikipedia_refrences": [
                    "https://en.wikipedia.org/wiki/Map_symbol",
                    "https://en.wikipedia.org/wiki/Map_scale"
                ]
            },
            {
                "Lecture": "Along with map symbols, understanding the scale of a map is equally important. The scale of a map informs you about the relationship between the map and the real world. For example, a map scale might say 1:100,000, which means that one unit of measurement on the map is equivalent to 100,000 of the same units on the ground. This enables you to measure distances accurately. For instance, if a river is two centimeters long on a map and the scale is 1:100,000, then the actual river is 200,000 centimeters long, or 2 kilometers. Properly interpreting scales helps you to travel and plan routes in real life or simply understand the magnitude and distance of geographical features. Remember, the scale can greatly affect how we perceive the size of things on a map. Some maps show large areas like entire countries, while others show regions as small as a neighborhood.",
                "summary": "Today, we honed our skill in interpreting maps using legends and scale to understand real-world distances and symbols used universally to depict various geographical and man-made features on maps. With these skills, reading maps becomes a powerful tool for exploration and understanding the world around us.",
                "wikipedia_refrences": [
                    "https://en.wikipedia.org/wiki/Map_scale"
                ]
            }
        ]
    }
]