[
    {
        "lessons": [
            {
                "Lecture": "In Math today, we will start learning about Integers and Absolute Values, a fundamental concept in mathematics.\n\nLet's begin with the Definition of Integers. Integers are a set of numbers that include all the whole numbers and their negative counterparts. This means they go from negative infinity all the way through to positive infinity, including zero. It's important to remember that integers do not include fractions or decimals. So, examples of integers would be -3, 0, 4, and 21.\n\nIn everyday life, we encounter integers regularly. For example, temperatures can be expressed as integers. When the weather forecast says it's -2 degrees, that's a negative integer. If your goal in a video game is to gain or lose points, those points are likely represented as integers.\n\n$Break time\n\nNext, let's delve into Positive and Negative Numbers, which are both part of the integer family. Positive numbers are those greater than zero. They are found to the right of zero on a number line and do not have a plus sign noted in front of them, although they are positive. Some examples are 1, 8, and 50.\n\nNegative numbers are less than zero and appear to the left of zero on the number line. They always have a minus sign (-) in front of them. Examples of negative numbers include -1, -8, and -50. Negative numbers are often used to represent situations like debts or temperatures below freezing.\n\nNow, let’s take a few moments to think about examples in real life where you observe positive and negative numbers.\n\n$Break time\n\nFinally, we come to Absolute Value Meaning. The absolute value of a number refers to its distance from zero, regardless of direction on the number line. Absolute value is always a non-negative number because distance can't be negative.\n\nTo denote the absolute value of a number, we use vertical lines around the number. For instance, the absolute value of -7 is written as |-7|, which equals 7. This is because -7 is 7 units away from zero. Likewise, the absolute value of 7 is |7|, which is also 7, because it is 7 units away from zero.\n\nAbsolute values are particularly useful in situations where only the size of a number matters, not its direction, like when calculating differences in temperatures or distances.\n\nIt is essential to practice understanding absolute values, as they form the basis for more complex math topics you'll encounter in the future.\n\nWikipedia references:\n1. https://en.wikipedia.org/wiki/Integer\n2. https://en.wikipedia.org/wiki/Negative_number\n3. https://en.wikipedia.org/wiki/Absolute_value",
                "summary": "Today, we have explored Integers and Absolute Values. We started by defining integers, which include positive and negative whole numbers as well as zero. We explored positive and negative numbers, learning how they are located on the number line and how they are used in real-life situations. Finally, we understood the concept of absolute value, which measures the distance of a number from zero, helping us comprehend its importance in mathematical calculations. This foundational knowledge will be crucial as you progress in your mathematical journey.",
                "wikipedia_refrences": [
                    "https://en.wikipedia.org/wiki/Integer",
                    "https://en.wikipedia.org/wiki/Negative_number",
                    "https://en.wikipedia.org/wiki/Absolute_value"
                ]
            }
        ]
    }
]